In [1]:
import pandas as pd
import numpy as np

In [2]:
# titanic
import seaborn as sns

titanic = sns.load_dataset('titanic')
titanic["age_b"] = pd.cut(titanic["age"], [0, 18, 80])
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_b
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,"(18, 80]"
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,"(18, 80]"
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,"(18, 80]"
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,"(18, 80]"
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,"(18, 80]"

In [8]:
df = titanic.melt()
print(f"{df.shape}")
df.head(5)

(14256, 2)

   variable value
0  survived     0
1  survived     1
2  survived     1
3  survived     1
4  survived     0

In [7]:
df = titanic.melt(value_vars=["survived"])
print(f"{df.shape}")
df.head(5)

(891, 2)

   variable  value
0  survived      0
1  survived      1
2  survived      1
3  survived      1
4  survived      0